# How to merge two datasets
This notebook is a PoC for merging two data sets based on a column.  It is based on [Jezrael (2016)](https://stackoverflow.com/questions/37697195/how-to-merge-two-data-frames-based-on-particular-column-in-pandas-python).

In [1]:
import pandas as pd

In [2]:
# OK to mix data types
# Extra values (that are not present in both) are 
# silently dropped by default (how=inner), but all
# are preserved if using how=outer in pd.merge.
d1 = {'id': ["A", "B", 3, 4, "D"], 'value1': [5, 6, 7, 8, 1]}
df1 = pd.DataFrame(data=d1)

# OK to change the order of the values in id
d2 = {'id': ["A", 3, "B", 4], 'value2': [9, 10, 11, "C"]}
df2 = pd.DataFrame(data=d2)

In [3]:
df1

  id  value1
0  A       5
1  B       6
2  3       7
3  4       8
4  D       1

In [4]:
df2

  id value2
0  A      9
1  3     10
2  B     11
3  4      C

In [5]:
df3 = pd.merge(df1, df2, on='id', how='outer')

In [6]:
df3

  id  value1 value2
0  A       5      9
1  B       6     11
2  3       7     10
3  4       8      C
4  D       1    NaN